app/controllers/customer_controller.rb

    def do_login
        customer = Customer.find_by_email(params[:email])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`email` = 'tundeaminu@gmail.com' LIMIT 1